lib/tasks/dev.rake

INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigo"], ["created_at", "2021-01-01 23:30:47.178808"], ["updated_at", "2021-01-01 23:30:47.178808"]]
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigo"], ["created_at", "2021-01-01 23:24:49.154204"], ["updated_at", "2021-01-01 23:24:49.154204"]]
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at", "kind_id") VALUES (?, ?, ?, ?, ?, ?)
SELECT "kinds".* FROM "kinds"
SELECT "contacts".* FROM "contacts"
INSERT INTO "phones" ("number", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", "(91) 99755-9613"], ["contact_id", 1], ["created_at", "2021-01-02 01:21:01.880504"], ["updated_at", "2021-01-02 01:21:01.880504"]]
---
  task setup: :environment do
    %x(rails db:drop db:create db:migrate)
    puts "Tipos Cadastrando contatos..."

    kinds = %w(Amigo Comercial Conhecido)

    kinds.each do |kind|
      Kind.create!(
        description: kind
      )
    end
    puts "Tipos Contatos cadastrados com sucesso"

    ###################

    puts "Cadastrando contatos..."
    100.times do |i|
      Contact.create!(
        name: Faker::Name.name,
        email: Faker::Internet.email,
        birthdate: Faker::Date.between(65.days.ago, 18.days.ago),
        kind:  Kind.all.sample
      )
    end
    puts "Contatos cadastrados com sucesso"

    ###################

    puts "Cadastrando telefones..."
    Contact.all.each do |contact|
      Random.rand(5).times do |i|
        Phone.create!(number:Faker::PhoneNumber.cell_phone, contact: contact)

SELECT "contacts".* FROM "contacts"
INSERT INTO "addresses" ("street", "city", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["street", "Avenida Gabrielly Aparício"], ["city", "José da Penha"], ["contact_id", 1], ["created_at", "2021-01-04 00:51:03.016176"], ["updated_at", "2021-01-04 00:51:03.016176"]]
---
    ####################

    puts "Cadastrando endereços"
    Contact.all.each do |contact|
      address = Address.create(city:Faker::Address.city, street:Faker::Address.street_name, contact: contact)