app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["email", "barbarstoltenberg@goldner.name"], ["birthdate", "2020-10-31"], ["created_at", "2021-01-01 23:44:46.431843"], ["updated_at", "2021-01-01 23:44:46.431843"]]

  def update
    if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "test 2"], ["updated_at", "2021-01-04 00:20:16.954311"], ["id", 106]]